In [14]:
type(result)

pandas.core.series.Series

In [13]:
# Áp dụng hàm sum() lên cột 'value' của mỗi nhóm
result = grouped['value'].apply(np.sum)    #Sử dụng phương thức apply để áp dung hàm tùy chỉnh np.sum() lên cột giá trị

# In kết quả
print("Result: \n", result)

Result:
 key
A     3
B     7
C    11
Name: value, dtype: int64

In [12]:
# Gom nhóm dữ liệu theo cột 'key'
grouped = df.groupby('key')

In [11]:
# DataFrame gốc
df = pd.DataFrame({'key': ['A','A','B','B', 'C', 'C'],
                   'value': [1, 2, 3, 4, 5, 6]})
df

  key  value
0   A      1
1   A      2
2   B      3
3   B      4
4   C      5
5   C      6

In [10]:
# Lọc các nhóm có giá trị 2 trung bình lớn hơn 5
filtered = grouped.filter(lambda x: x['giatri_2'].mean() > 5)

# In nội dung của DataFrame 'filtered'
print("filtered: \n", filtered)

filtered:
   key  giatri_1  giatri_2
0   A        24         4
3   A        33         8

In [9]:
grouped = df.groupby('key')
normalized = (df['giatri_1'] - grouped['giatri_1'].transform('mean')) / grouped['giatri_1'].transform('std')
normalized

0   -0.707107
1   -0.707107
2    0.707107
3    0.707107
4    0.707107
5   -0.707107
Name: giatri_1, dtype: float64

In [8]:
result = grouped.agg({'giatri_1': "sum", 'giatri_2': "mean"})       #Dùng Chuỗi ký tự ("sum" thay cho hàm python sum Đối với cột giatri_1) để tôi ưu hóa hiệu suất
result

     giatri_1  giatri_2
key
A          57       6.0
B         111       4.5
C         114       1.0

In [7]:
groupped = df.groupby('key')
result = grouped.agg(
    {
        #'giatri_1':sum, 'giatri_2':lambda x:x.mean() #truyền hàm python gốc 'sum' để tính tổng cột 'giatri_1' theo nhóm đã được nhóm
        'giatri_1':lambda x:x.sum(),  #việc phải tạo và gọi hàm lambda cho mỗi nhóm sẽ làm giảm hiệu suất so với cơ chế tối ưu hóa nội bộ của Pandas.
        'giatri_2':lambda x:x.mean()
    })
result

     giatri_1  giatri_2
key
A          57       6.0
B         111       4.5
C         114       1.0

In [6]:
df

  key  giatri_1  giatri_2
0   A        24         4
1   B        44         3
2   C        85         1
3   A        33         8
4   B        67         6
5   C        29         1

In [5]:
grouped = df.groupby('key')
result = grouped.aggregate({'giatri_1': ['sum', 'mean']}) #Ap dụng hàm sum() , mean() trên cột giatri_1 theo từng nhóm
result

    giatri_1
         sum  mean
key
A         57  28.5
B        111  55.5
C        114  57.0

In [4]:
df

  key  giatri_1  giatri_2
0   A        24         4
1   B        44         3
2   C        85         1
3   A        33         8
4   B        67         6
5   C        29         1

In [3]:
print(df.groupby('key').get_group('A'))

  key  giatri_1  giatri_2
0   A        24         4
3   A        33         8

In [2]:
for key, giatri in df.groupby('key'):
    print("\nkey: ",key)
    print("value: \n",giatri)

key:  A
value:
   key  giatri_1  giatri_2
0   A        24         4
3   A        33         8

key:  B
value:
   key  giatri_1  giatri_2
1   B        44         3
4   B        67         6

key:  C
value:
   key  giatri_1  giatri_2
2   C        85         1
5   C        29         1

In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        'key':['A','B','C','A','B','C'],
        'giatri_1':np.random.randint(10,100,6),
        'giatri_2':np.random.randint(0,10,6)
    },
    columns=['key','giatri_1','giatri_2']
)
print("df: \n",df)

df:
   key  giatri_1  giatri_2
0   A        24         4
1   B        44         3
2   C        85         1
3   A        33         8
4   B        67         6
5   C        29         1